app/controllers/user_controller.rb

  def show
  	@user = User.find(params[:id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]